app/controllers/gallery_controller.rb

  def show
    @gallery = Gallery.find_by_subdomain( request.subdomain ) || Gallery.find_by_subdomain( params[:subdomain] )
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."subdomain" = $1 LIMIT 1  [["subdomain", ""]]