app/controllers/users_controller.rb

SELECT  "invites".* FROM "invites" WHERE "invites"."code" = ? LIMIT 1  [["code", ""]]
---
  def new
    invite = Invite.find_by_code( userparams[:invite_code] )