app/controllers/users_controller.rb

  def create
    @autofill_email = userparams[:email] || ""
    invite = Invite.find_by_code( inviteparams[:code] )
    puts invite
    puts "helllo"
    if invite && invite.uses > 0
      # create user!
      # flash.now[:signup] = "Invite code is correct! :D!"
      user = User.create( userparams );
---
SELECT  "invites".* FROM "invites" WHERE "invites"."code" = ? LIMIT 1  [["code", ""]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "marco"], ["password_digest", "$2a$10$oKFgFZorZ.uETxcL/PW/KOUuTcKYXxEv3aacyth.BSMmwRXzwBZMm"], ["created_at", "2016-04-25 20:40:16.654092"], ["updated_at", "2016-04-25 20:40:16.654092"]]